/*******************************************************************************
* ÊµÑéÃû			   :ÎÂ¶ÈÏÔÊ¾ÊµÑé
* Ê¹ÓÃµÄIO	     : 
* ÊµÑéĞ§¹û       :1602ÏÔÊ¾ÎÂ¶È
*	×¢Òâ					 £º
*******************************************************************************/

#include<reg51.h>
#include"lcd.h"
#include"temp.h"

uchar CNCHAR[6] = "ÉãÊÏ¶È";
void LcdDisplay(int);
void UsartConfiguration();

/*******************************************************************************
* º¯ÊıÃû         : main
* º¯Êı¹¦ÄÜ		   : Ö÷º¯Êı
* ÊäÈë           : ÎŞ
* Êä³ö         	 : ÎŞ
*******************************************************************************/

void main()
{
	UsartConfiguration();
	LcdInit();			 //³õÊ¼»¯LCD1602
	LcdWriteCom(0x88);	//Ğ´µØÖ· 80±íÊ¾³õÊ¼µØÖ·
	LcdWriteData('C'); 
	while(1)
	{
		LcdDisplay(Ds18b20ReadTemp());
//		Delay1ms(1000);//1sÖÓË¢Ò»´Î
	}
}

/*******************************************************************************
* º¯ÊıÃû         : LcdDisplay()
* º¯Êı¹¦ÄÜ		   : LCDÏÔÊ¾¶ÁÈ¡µ½µÄÎÂ¶È
* ÊäÈë           : v
* Êä³ö         	 : ÎŞ
*******************************************************************************/

void LcdDisplay(int temp) 	 //lcdÏÔÊ¾
{
    
  	unsigned char i, datas[] = {0, 0, 0, 0, 0}; //¶¨ÒåÊı×é
	float tp;  
	if(temp< 0)				//µ±ÎÂ¶ÈÖµÎª¸ºÊı
  	{
	  	LcdWriteCom(0x80);		//Ğ´µØÖ· 80±íÊ¾³õÊ¼µØÖ·
		SBUF='-';//½«½ÓÊÕµ½µÄÊı¾İ·ÅÈëµ½·¢ËÍ¼Ä´æÆ÷
		while(!TI);			         //µÈ´ı·¢ËÍÊı¾İÍê³É
		TI=0;						 //Çå³ı·¢ËÍÍê³É±êÖ¾Î»
	    LcdWriteData('-');  		//ÏÔÊ¾¸º
		//ÒòÎª¶ÁÈ¡µÄÎÂ¶ÈÊÇÊµ¼ÊÎÂ¶ÈµÄ²¹Âë£¬ËùÒÔ¼õ1£¬ÔÙÈ¡·´Çó³öÔ­Âë
		temp=temp-1;
		temp=~temp;
		tp=temp;
		temp=tp*0.0625*100+0.5;	
		//ÁôÁ½¸öĞ¡Êıµã¾Í*100£¬+0.5ÊÇËÄÉáÎåÈë£¬ÒòÎªCÓïÑÔ¸¡µãÊı×ª»»ÎªÕûĞÍµÄÊ±ºò°ÑĞ¡Êıµã
		//ºóÃæµÄÊı×Ô¶¯È¥µô£¬²»¹ÜÊÇ·ñ´óÓÚ0.5£¬¶ø+0.5Ö®ºó´óÓÚ0.5µÄ¾ÍÊÇ½ø1ÁË£¬Ğ¡ÓÚ0.5µÄ¾Í
		//ËãÓÉÏ0.5£¬»¹ÊÇÔÚĞ¡ÊıµãºóÃæ¡£
 
  	}
 	else
  	{			
	  	LcdWriteCom(0x80);		//Ğ´µØÖ· 80±íÊ¾³õÊ¼µØÖ·
	    LcdWriteData('+'); 		//ÏÔÊ¾Õı
		SBUF='+';//½«½ÓÊÕµ½µÄÊı¾İ·ÅÈëµ½·¢ËÍ¼Ä´æÆ÷
		while(!TI);			         //µÈ´ı·¢ËÍÊı¾İÍê³É
		TI=0;						 //Çå³ı·¢ËÍÍê³É±êÖ¾Î»
		tp=temp;//ÒòÎªÊı¾İ´¦ÀíÓĞĞ¡ÊıµãËùÒÔ½«ÎÂ¶È¸³¸øÒ»¸ö¸¡µãĞÍ±äÁ¿
		//Èç¹ûÎÂ¶ÈÊÇÕıµÄÄÇÃ´£¬ÄÇÃ´ÕıÊıµÄÔ­Âë¾ÍÊÇ²¹ÂëËü±¾Éí
		temp=tp*0.0625*100+0.5;	
		//ÁôÁ½¸öĞ¡Êıµã¾Í*100£¬+0.5ÊÇËÄÉáÎåÈë£¬ÒòÎªCÓïÑÔ¸¡µãÊı×ª»»ÎªÕûĞÍµÄÊ±ºò°ÑĞ¡Êıµã
		//ºóÃæµÄÊı×Ô¶¯È¥µô£¬²»¹ÜÊÇ·ñ´óÓÚ0.5£¬¶ø+0.5Ö®ºó´óÓÚ0.5µÄ¾ÍÊÇ½ø1ÁË£¬Ğ¡ÓÚ0.5µÄ¾Í
		//Ëã¼ÓÉÏ0.5£¬»¹ÊÇÔÚĞ¡ÊıµãºóÃæ¡£
	}
	datas[0] = temp / 10000;
	datas[1] = temp % 10000 / 1000;
	datas[2] = temp % 1000 / 100;
	datas[3] = temp % 100 / 10;
	datas[4] = temp % 10;

	LcdWriteCom(0x82);		  //Ğ´µØÖ· 80±íÊ¾³õÊ¼µØÖ·
	LcdWriteData('0'+datas[0]); //°ÙÎ» 
	SBUF = '0'+datas[0];//½«½ÓÊÕµ½µÄÊı¾İ·ÅÈëµ½·¢ËÍ¼Ä´æÆ÷
	while (!TI);			         //µÈ´ı·¢ËÍÊı¾İÍê³É
	TI = 0;
	
	LcdWriteCom(0x83);		 //Ğ´µØÖ· 80±íÊ¾³õÊ¼µØÖ·
	LcdWriteData('0'+datas[1]); //Ê®Î»
	SBUF = '0'+datas[1];//½«½ÓÊÕµ½µÄÊı¾İ·ÅÈëµ½·¢ËÍ¼Ä´æÆ÷
	while (!TI);			         //µÈ´ı·¢ËÍÊı¾İÍê³É
	TI = 0;

	LcdWriteCom(0x84);		//Ğ´µØÖ· 80±íÊ¾³õÊ¼µØÖ·
	LcdWriteData('0'+datas[2]); //¸öÎ» 
	SBUF = '0'+datas[2];//½«½ÓÊÕµ½µÄÊı¾İ·ÅÈëµ½·¢ËÍ¼Ä´æÆ÷
	while (!TI);			         //µÈ´ı·¢ËÍÊı¾İÍê³É
	TI = 0;

	LcdWriteCom(0x85);		//Ğ´µØÖ· 80±íÊ¾³õÊ¼µØÖ·
	LcdWriteData('.'); 		//ÏÔÊ¾ ¡®.¡¯
	SBUF = '.';//½«½ÓÊÕµ½µÄÊı¾İ·ÅÈëµ½·¢ËÍ¼Ä´æÆ÷
	while (!TI);			         //µÈ´ı·¢ËÍÊı¾İÍê³É
	TI = 0;

	LcdWriteCom(0x86);		 //Ğ´µØÖ· 80±íÊ¾³õÊ¼µØÖ·
	LcdWriteData('0'+datas[3]); //ÏÔÊ¾Ğ¡Êıµã  
	SBUF = '0'+datas[3];//½«½ÓÊÕµ½µÄÊı¾İ·ÅÈëµ½·¢ËÍ¼Ä´æÆ÷
	while (!TI);			         //µÈ´ı·¢ËÍÊı¾İÍê³É
	TI = 0;

	LcdWriteCom(0x87);		 //Ğ´µØÖ· 80±íÊ¾³õÊ¼µØÖ·
	LcdWriteData('0'+datas[4]); //ÏÔÊ¾Ğ¡Êıµã 
	SBUF = '0'+datas[4];//½«½ÓÊÕµ½µÄÊı¾İ·ÅÈëµ½·¢ËÍ¼Ä´æÆ÷
	while (!TI);			         //µÈ´ı·¢ËÍÊı¾İÍê³É
	TI = 0;
	for(i=0; i<6; i++)
	{
	 	SBUF = CNCHAR[i];//½«½ÓÊÕµ½µÄÊı¾İ·ÅÈëµ½·¢ËÍ¼Ä´æÆ÷
		while (!TI);			         //µÈ´ı·¢ËÍÊı¾İÍê³É
		TI = 0;
	}

	 
}
/*******************************************************************************
* º¯ Êı Ãû         :UsartConfiguration()
* º¯Êı¹¦ÄÜ		   :ÉèÖÃ´®¿Ú
* Êä    Èë         : ÎŞ
* Êä    ³ö         : ÎŞ
*******************************************************************************/

void UsartConfiguration()
{
	SCON=0X50;			//ÉèÖÃÎª¹¤×÷·½Ê½1
	TMOD=0X20;			//ÉèÖÃ¼ÆÊıÆ÷¹¤×÷·½Ê½2
	PCON=0X80;			//²¨ÌØÂÊ¼Ó±¶
	TH1=0XF3;				//¼ÆÊıÆ÷³õÊ¼ÖµÉèÖÃ£¬×¢Òâ²¨ÌØÂÊÊÇ4800µÄ
	TL1=0XF3;
//	ES=1;						//´ò¿ª½ÓÊÕÖĞ¶Ï
//	EA=1;						//´ò¿ª×ÜÖĞ¶Ï
	TR1=1;					//´ò¿ª¼ÆÊıÆ÷
}
